test/nexj/core/persistence/sql/data/readSubclass.xml


<!-- Copyright 2010 NexJ Systems Inc. This software is licensed under the terms of the Eclipse Public License 1.0 -->
<nv:Envelope xmlns:nv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema">
   <nv:Body xmlns:ns="http://www.nexjsystems.com/xml-soap" nv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <ns:Array>
         <items nc:arrayType="xs:anyType[4]">
            <Item href="#a"/>
            <Item href="#b"/>
            <Item href="#c"/>
            <Item href="#d"/>
         </items>
      </ns:Array>
      <ns:TransferObject id="a">
         <class>Patient</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAACA==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[1]">
            <Item>fullName</Item>
         </keys>
         <values nc:arrayType="xs:anyType[1]">
            <Item xi:type="xs:string">Andy  Babb</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="b">
         <class>Patient</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAACQ==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[1]">
            <Item>fullName</Item>
         </keys>
         <values nc:arrayType="xs:anyType[1]">
            <Item xi:type="xs:string">John  Sabine</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="c">
         <class>Patient</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAABg==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[1]">
            <Item>fullName</Item>
         </keys>
         <values nc:arrayType="xs:anyType[1]">
            <Item xi:type="xs:string">Sarah  Johnson</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="d">
         <class>Patient</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAABw==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[1]">
            <Item>fullName</Item>
         </keys>
         <values nc:arrayType="xs:anyType[1]">
            <Item xi:type="xs:string">Zach  Tachoma</Item>
         </values>
      </ns:TransferObject>
   </nv:Body>
</nv:Envelope>
